#### DuctFittingAndAccessoryPressureDropUIData Members

---

|  |
| --- |
| DuctFittingAndAccessoryPressureDropUIData Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryPressureDropUIData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryPressureDropUIData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetUIDataItems | Gets all UI data items stored in the UI data. |
| Public method | GetUnits | Gets units. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DuctFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Mechanical Namespace